Revit 2026 API

# IExternalCommandAvailability Interface

---

An interface that should be implemented to provide the implementation for a accessibility check for a Revit add-in External Command.

**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public interface IExternalCommandAvailability
```
```vb
Public Interface IExternalCommandAvailability
```
```cpp
public interface class IExternalCommandAvailability
```
```fsharp
type IExternalCommandAvailability = interface end
```

The IExternalCommandAvailability type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsCommandAvailable | Implement this method to provide control over whether your external command is enabled or disabled. |

This interface should share the same assembly with add-in External Command.

#### Reference

Autodesk.Revit.UI Namespace